## Series
- The first data type in Pandas is the Series data type, that is the Series object.
- A Series is very similar to a NumPy array (in fact it is built on top of the NumPy array object). 
- What differentiates the NumPy array from a Series, is that a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location. 
- It also doesn't need to hold numeric data, it can hold any arbitrary Python Object.

In [1]:
import numpy as np
import pandas as pd

In [2]:
labels=['a','b','c']
my_list=[10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [3]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data=my_list,index=labels) # list

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(my_list,labels) # list (same as above)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(arr) # numpy array

0    10
1    20
2    30
dtype: int32

In [7]:
pd.Series(arr,labels) # numpy array with labels

a    10
b    20
c    30
dtype: int32

In [8]:
pd.Series(d) # dictionary

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(data=labels) # list (even with string)

0    a
1    b
2    c
dtype: object

In [10]:
pd.Series([sum,print,len]) # list (even with functions)

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [11]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])

In [12]:
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])

In [13]:
ser1['USA'] # indexing using labels

1

In [14]:
ser1[1] # indexing using numbers

2

In [15]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [16]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

## DataFrames
- DataFrames are the workhorse of pandas and are directly inspired by the R programming language.
- DataFrame is a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [17]:
np.random.seed(101)

In [18]:
# index : rows , columns : cols
df=pd.DataFrame(np.random.rand(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [19]:
df['W'] # Single column

A    0.516399
B    0.685277
C    0.721544
D    0.181892
E    0.083561
Name: W, dtype: float64

In [20]:
df[['W','Z']] # Multiple columns

          W         Z
A  0.516399  0.171522
B  0.685277  0.893613
C  0.721544  0.352132
D  0.181892  0.232354
E  0.083561  0.276239

In [21]:
df.Y # SQL Syntax

A    0.028474
B    0.306966
C    0.554228
D    0.965483
E    0.728993
Name: Y, dtype: float64

In [22]:
type(df['W']) # Pandas DataFrames are multiple series joined together

pandas.core.series.Series

In [23]:
df['new']=df['W']+df['Y'];
df

          W         X         Y         Z       new
A  0.516399  0.570668  0.028474  0.171522  0.544873
B  0.685277  0.833897  0.306966  0.893613  0.992243
C  0.721544  0.189939  0.554228  0.352132  1.275771
D  0.181892  0.785602  0.965483  0.232354  1.147376
E  0.083561  0.603548  0.728993  0.276239  0.812554

In [24]:
df.drop('new',axis=1,inplace=True) 

# specify the inplace argument for permanent change
# axis 0 for row and 1 for column

In [25]:
df.drop('E',axis=0)

          W         X         Y         Z
A  0.516399  0.570668  0.028474  0.171522
B  0.685277  0.833897  0.306966  0.893613
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354

In [26]:
df.loc['A'] # indexing rows using loc labels

W    0.516399
X    0.570668
Y    0.028474
Z    0.171522
Name: A, dtype: float64

In [27]:
df.loc[:,'W'] # indexing columns using loc labels

A    0.516399
B    0.685277
C    0.721544
D    0.181892
E    0.083561
Name: W, dtype: float64

In [28]:
df.loc['B','Y']

0.3069662196722378

In [29]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.516399  0.028474
B  0.685277  0.306966

In [30]:
df.iloc[:,2] # indexing rows and columns using numbers

A    0.028474
B    0.306966
C    0.554228
D    0.965483
E    0.728993
Name: Y, dtype: float64

### Conditional Selection

In [31]:
df>0

      W     X     Y     Z
A  True  True  True  True
B  True  True  True  True
C  True  True  True  True
D  True  True  True  True
E  True  True  True  True

In [32]:
df[df>0]

          W         X         Y         Z
A  0.516399  0.570668  0.028474  0.171522
B  0.685277  0.833897  0.306966  0.893613
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354
E  0.083561  0.603548  0.728993  0.276239

In [33]:
df[df['W']>0][['Y','X']]  # select multiple columns from the condition

          Y         X
A  0.028474  0.570668
B  0.306966  0.833897
C  0.554228  0.189939
D  0.965483  0.785602
E  0.728993  0.603548

In [34]:
df[(df['W']>0.5) & (df['Y'] > 0.5)]  # use  | or & to use multiple conditions

          W         X         Y         Z
C  0.721544  0.189939  0.554228  0.352132

### Reindexing and Multi-indexing

In [35]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.516399  0.570668  0.028474  0.171522
1     B  0.685277  0.833897  0.306966  0.893613
2     C  0.721544  0.189939  0.554228  0.352132
3     D  0.181892  0.785602  0.965483  0.232354
4     E  0.083561  0.603548  0.728993  0.276239

In [36]:
new_index='CA NY WY OR CO'.split(); 
df['States']=new_index

In [37]:
df.set_index('States',inplace=True); 
df

               W         X         Y         Z
States
CA      0.516399  0.570668  0.028474  0.171522
NY      0.685277  0.833897  0.306966  0.893613
WY      0.721544  0.189939  0.554228  0.352132
OR      0.181892  0.785602  0.965483  0.232354
CO      0.083561  0.603548  0.728993  0.276239

In [38]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [39]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [40]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  0.190794  1.978757
   2  2.605967  0.683509
   3  0.302665  1.693723
G2 1 -1.706086 -1.159119
   2 -0.134841  0.390528
   3  0.166905  0.184502

In [41]:
df.loc['G1']

          A         B
1  0.190794  1.978757
2  2.605967  0.683509
3  0.302665  1.693723

In [42]:
df.loc['G1'].loc[1]

A    0.190794
B    1.978757
Name: 1, dtype: float64

In [43]:
df.index.names

FrozenList([None, None])

In [44]:
df.index.names=['Group','Num']; df

                  A         B
Group Num
G1    1    0.190794  1.978757
      2    2.605967  0.683509
      3    0.302665  1.693723
G2    1   -1.706086 -1.159119
      2   -0.134841  0.390528
      3    0.166905  0.184502

In [45]:
df.xs('G1')

            A         B
Num
1    0.190794  1.978757
2    2.605967  0.683509
3    0.302665  1.693723

In [46]:
df.xs(['G1',1])  # xs is used to select data in multi-index

A    0.190794
B    1.978757
Name: (G1, 1), dtype: float64

In [47]:
df.xs(1,level="Num")

              A         B
Group
G1     0.190794  1.978757
G2    -1.706086 -1.159119

### Missing Data

In [48]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [49]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [50]:
df.dropna()  # drop all rows with any missing data

     A    B  C
0  1.0  5.0  1

In [51]:
df.dropna(axis=1) # drop all cols with any missing data

   C
0  1
1  2
2  3

In [52]:
df.dropna(thresh=2) # drop rows till the threshold (not rows but elements)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [53]:
df.fillna(value=0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [54]:
df.fillna(value=df['A'].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

### Groupby

In [55]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [56]:
df=pd.DataFrame(data)

In [57]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [58]:
comp=df.groupby('Company')

In [59]:
comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [60]:
comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [61]:
comp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [62]:
comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [63]:
comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [64]:
comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [65]:
comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [66]:
comp.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

### Merging , Joining and Concatenating

In [67]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [68]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [69]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [70]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [71]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [72]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [73]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [74]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [75]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [76]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [77]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [78]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [79]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [80]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [81]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [82]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [83]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

### Operations

In [84]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [85]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [86]:
df['col2'].nunique()

3

In [87]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [88]:
newdf = df[(df['col1']>2) & (df['col2']==444)]; newdf

   col1  col2 col3
3     4   444  xyz

In [89]:
def times2(x):
    return x*2

In [90]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [91]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [92]:
df['col1'].sum()

10

In [93]:
del df['col1']; df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [94]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [95]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [96]:
df.sort_values(by='col2') # use the inplace argument for permanent

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [97]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [98]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data) ; df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [99]:
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

### Read and Write from files

In [100]:
df=pd.read_csv('sample.csv',index_col=0); df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [101]:
pd.read_excel('sample.xlsx',index_col=0)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15